#include "Controller.h"
//---------------------------
int main()
{
	srand(static_cast<unsigned>(time(nullptr)));
	Controller c;
	c.run();
	return 0;
}
//לעשות את ה 
//observer
//בשביל האחוזים - בין הבורד ללוול ולאינפורמיישן מניו
//לעשות שדה של טקסט באינפורמיישן.. ולעדכן אותו כל פעם באחוזים


//לשאול את ברוריה:
//איך עושים את התזוזה על החסומים
//איך עושים תזוזה חכמה - להתחיל לבד..
//(איך לטפל בבריחה מלוח)
//לשאול למה הוקטור לא עובד
//לשאול אם זה נורא שיוצאים מהגבולות

//לעשות מטריצה במחלקה נפרדת, שתהיה בבורד.
//שם יהיה מספר האויבים 
//נוכל לשנות ברגע שנוסיף אחד.